Catalogs/Новости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Новости</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛентаНовостей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛентыНовостей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИННовости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьВОбщемСпискеНовостей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подзаголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНовости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНовостиДляВнешнихИсточников</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаПолныйТекстНовости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСбросаВажности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоСбросНапоминанияПриПрочтении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриОткрытииСразуПереходитьПоСсылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УИНДействия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыДействий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УИНДействия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПривязкаКМетаданным</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метаданные</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Форма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказыватьВФормеОбъекта</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСбросаПоказаВФормеОбъекта</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Важность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСбросаВажности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПостояннаяНовость</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСбросаПостояннойНовости</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БинарныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УИН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Данные</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтернетСсылка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокСортировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/РазрешенныеДляРедактированияЛентыНовостей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РазрешенныеДляРедактированияЛентыНовостей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛентаНовостей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛентыНовостей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЛентыНовостей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЛентыНовостей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбязательныйКанал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Протокол</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЛогинаПароля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантЛогинаПароляДляЛентыНовостей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженоССервера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидимостьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастотаОбновления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПропускатьЗагрузкуБинарныхДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛокальнаяЛентаНовостей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеКатегорииНовостей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияНовостей</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.КатегорииНовостей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешеноНастраиватьПользователям</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборНастраиваетсяНаСервере</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсключенияВидимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Новости/Forms/ФормаСпискаДляРедактирования/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

&НаКлиенте
Перем ВсеОповещения;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтотОбъект.Справочник_Новости_ПустаяСсылка = Справочники.Новости.ПустаяСсылка();

	// Получить таблицу метаданных единожды, чтобы потом передавать ее в форму документа.
	ЭтотОбъект.ТаблицаМетаданных.Загрузить(ОбработкаНовостейПовтИсп.ПолучитьТаблицуМетаданных());

	ПараметрыТекущегоПользователя = ОбработкаНовостейПовтИсп.ПараметрыТекущегоПользователя();

	// В конфигурации есть общие реквизиты с разделением и включена ФО РаботаВМоделиСервиса.
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		// Если вошли в область данных, то нельзя пересчитывать служебные данные.
		Если ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
			ЭтотОбъект.ТолькоПросмотр = Истина;
		КонецЕсли;
		// Если включено разделение данных, и мы зашли в неразделенном сеансе,
		//  то нельзя устанавливать пользовательские свойства новости.
		// Зашли в конфигурацию под пользователем без разделения (и не вошли в область данных).
		Если ИнтернетПоддержкаПользователей.СеансЗапущенБезРазделителей() Тогда
			ПолучитьТекущегоПользователя = Ложь;
			// В этом режиме редактировать новости может только пользователь с ролями АдминистраторСистемы и ПолныеПрава (все локальные ленты новостей).
			лкВариантСпискаЛентНовостей = "Только для администратора"; // АПК:1297 Это идентификатор.
		Иначе
			ПолучитьТекущегоПользователя = Истина;
			// В этом режиме редактировать новости никто не может.
			лкВариантСпискаЛентНовостей = "Нет";
		КонецЕсли;
	Иначе
		ПолучитьТекущегоПользователя = Истина;
		// В этом режиме редактировать новости может пользователь с ролями АдминистраторСистемы и ПолныеПрава (все локальные ленты новостей)
		//  или пользователь с ролью РедактированиеНовостей.
		лкВариантСпискаЛентНовостей = "Для администратора или редактора новостей"; // АПК:1297 Это идентификатор.
	КонецЕсли;

	Если ПолучитьТекущегоПользователя = Истина Тогда
		ЭтотОбъект.ПараметрыСеанса_ТекущийПользователь = Пользователи.ТекущийПользователь();
	Иначе
		ЭтотОбъект.ПараметрыСеанса_ТекущийПользователь = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;

	// Получить список локальных лент новостей, в которых можно редактировать новости:
	// - Для пользователя с ролью АдминистрированиеСистемы и ПолныеПрава можно редактировать все ленты новостей,
	//    у которых ЗагруженоССервера = Ложь и ЛокальнаяЛентаНовостей = Истина;
	// - Для пользователей с ролью РедактированиеНовостей можно редактировать только
	//    разрешенные ему ленты новостей (из регистра сведений РазрешенныеДляРедактированияЛентыНовостей).
	Если лкВариантСпискаЛентНовостей = "Только для администратора" Тогда // АПК:1297 Это идентификатор.
		Если (ПараметрыТекущегоПользователя.ЕстьРольПолныеПрава = Истина)
				И (ПараметрыТекущегоПользователя.ЕстьРольАдминистраторСистемы = Истина) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "
				|ВЫБРАТЬ
				|	Спр.Ссылка КАК ЛентаНовостей
				|ИЗ
				|	Справочник.ЛентыНовостей КАК Спр
				|ГДЕ
				|	Спр.ЗагруженоССервера = ЛОЖЬ
				|	И Спр.ЛокальнаяЛентаНовостей = ИСТИНА
				|";
			Результат = Запрос.Выполнить(); // Справочник.Новости.ФормаСпискаДляРедактирования.ПриСозданииНаСервере(), РольПолныеПрава.
			Если НЕ Результат.Пустой() Тогда
				ЭтотОбъект.РазрешенныеДляРедактированияЛентыНовостей.ЗагрузитьЗначения(Результат.Выгрузить(ОбходРезультатаЗапроса.Прямой).ВыгрузитьКолонку("ЛентаНовостей"));
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли лкВариантСпискаЛентНовостей = "Для администратора или редактора новостей" Тогда // АПК:1297 Это идентификатор.
		Если (ПараметрыТекущегоПользователя.ЕстьРольПолныеПрава = Истина)
				И (ПараметрыТекущегоПользователя.ЕстьРольАдминистраторСистемы = Истина) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "
				|ВЫБРАТЬ
				|	Спр.Ссылка КАК ЛентаНовостей
				|ИЗ
				|	Справочник.ЛентыНовостей КАК Спр
				|ГДЕ
				|	Спр.ЗагруженоССервера = ЛОЖЬ
				|	И Спр.ЛокальнаяЛентаНовостей = ИСТИНА
				|";
			Результат = Запрос.Выполнить(); // Справочник.Новости.ФормаСпискаДляРедактирования.ПриСозданииНаСервере(), РольПолныеПрава
			Если НЕ Результат.Пустой() Тогда
				ЭтотОбъект.РазрешенныеДляРедактированияЛентыНовостей.ЗагрузитьЗначения(Результат.Выгрузить(ОбходРезультатаЗапроса.Прямой).ВыгрузитьКолонку("ЛентаНовостей"));
			КонецЕсли;
		ИначеЕсли (ПараметрыТекущегоПользователя.ЕстьРольРедактированиеНовостей = Истина) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "
				|ВЫБРАТЬ
				|	Рег.ЛентаНовостей КАК ЛентаНовостей
				|ИЗ
				|	РегистрСведений.РазрешенныеДляРедактированияЛентыНовостей КАК Рег
				|ГДЕ
				|	Рег.Пользователь = &ТекущийПользователь
				|	И Рег.ЛентаНовостей.ЗагруженоССервера = ЛОЖЬ
				|	И Рег.ЛентаНовостей.ЛокальнаяЛентаНовостей = ИСТИНА
				|";
			Запрос.УстановитьПараметр("ТекущийПользователь", ЭтотОбъект.ПараметрыСеанса_ТекущийПользователь);
			Результат = Запрос.Выполнить(); // Справочник.Новости.ФормаСпискаДляРедактирования.ПриСозданииНаСервере(), РольРедактированиеНовостей
			Если НЕ Результат.Пустой() Тогда
				ЭтотОбъект.РазрешенныеДляРедактированияЛентыНовостей.ЗагрузитьЗначения(Результат.Выгрузить(ОбходРезультатаЗапроса.Прямой).ВыгрузитьКолонку("ЛентаНовостей"));
			КонецЕсли;
		КонецЕсли;
	Иначе // Если лкВариантСпискаЛентНовостей = "Нет" Тогда
	КонецЕсли;

	ЭтотОбъект.НеобходимПересчетСлужебныхДанных = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ВсеОповещения = ОбработкаНовостейКлиент.ВсеОповещения();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы = Истина Тогда
		// Запрещены серверные вызовы и открытие форм.
		Если ЭтотОбъект.НеобходимПересчетСлужебныхДанных = Истина Тогда
			Отказ = Истина;
			ТекстПредупреждения = НСтр("ru='Необходим пересчет служебных данных.
				|Нажмите кнопку [Пересчет служебных данных]
				|или закройте окно вручную, до выхода из программы.'");
		КонецЕсли;
	Иначе
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если ЗавершениеРаботы = Истина Тогда
		// Запрещены серверные вызовы и открытие форм.
		// В таком исключительном случае, когда выходят из программы,
		//  можно проигнорировать установку признака прочтенности у новостей.
	Иначе
		Если ЭтотОбъект.НеобходимПересчетСлужебныхДанных = Истина Тогда
			ПересчетСлужебныхДанныхНаСервере();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	ТипСтруктура = Тип("Структура");
	ТипНовость   = Тип("СправочникСсылка.Новости");

	// В некоторых случаях ОбработкаОповещения может вызваться раньше чем ПриОткрытии.
	// Проверим это и инициализируем ВсеОповещения заново.
	ТипФиксированнаяСтруктура = Тип("ФиксированнаяСтруктура");
	Если ТипЗнч(ВсеОповещения) <> ТипФиксированнаяСтруктура Тогда
		ВсеОповещения = ОбработкаНовостейКлиент.ВсеОповещения();
	КонецЕсли;

	// Событие не имеет отношения к новостям.
	Если НЕ ОбработкаНовостейКлиент.ЕстьКлючПоЗначению(ВсеОповещения, ИмяСобытия) Тогда
		Возврат;
	КонецЕсли;

	Если ИмяСобытия = ВсеОповещения.СкопированыВсеКатегории Тогда
		Если ТипЗнч(Параметр) = ТипСтруктура Тогда
			ЗаполнитьБуферОбменаКатегорийСервер(Параметр);
		КонецЕсли;

	ИначеЕсли ИмяСобытия = ВсеОповещения.ПослеЗаписиНовости Тогда
		Если ТипЗнч(Источник) = ТипНовость Тогда
			ЭтотОбъект.НеобходимПересчетСлужебныхДанных = Истина;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	лкТекущаяСтрока = Элементы.НовостиСписок.ТекущаяСтрока;

	Отказ = Истина;

	// Нельзя добавлять новости, если нет ни одной локальной ленты новостей, где можно редактировать новости.
	// Разрешено редактировать все локальные ленты новостей пользователю с ролями АдминистраторСистемы и ПолныеПрава.
	// Разрешено редактировать разрешенные администратором локальные ленты новостей пользователю с ролью РедактированиеНовостей.
	Если ЭтотОбъект.РазрешенныеДляРедактированияЛентыНовостей.Количество()=0 Тогда
		ТекстСообщения = НСтр("ru='Нельзя добавлять новости, если нет ни одной локальной ленты новостей, где разрешено редактирование.
			|Пользователю с ролями АдминистраторСистемы и ПолныеПрава можно редактировать все локальные ленты новостей.
			|Пользователю с ролью РедактированиеНовостей можно редактировать разрешенные Администратором локальные ленты новостей.'");
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Копирование = Истина Тогда
		ПараметрыОткрытия = СформироватьПараметрыОткрытияФормыРедактированияНовости(
			ЭтотОбъект.Справочник_Новости_ПустаяСсылка,
			Копирование,
			лкТекущаяСтрока,
			0); // СтатусНовостиНаСервере = 0 (нет на сервере, т.к. у локальной базы нет соединения с новостным центром)
		ОткрытьФорму(
			"Справочник.Новости.Форма.ФормаДокумента",
			ПараметрыОткрытия,
			ЭтотОбъект,
			лкТекущаяСтрока);
	Иначе
		Если Элемент.ТекущиеДанные <> Неопределено Тогда
			ПараметрыОткрытия = СформироватьПараметрыОткрытияФормыРедактированияНовости(
				ЭтотОбъект.Справочник_Новости_ПустаяСсылка,
				Копирование,
				ЭтотОбъект.Справочник_Новости_ПустаяСсылка,
				0); // СтатусНовостиНаСервере = 0 (нет на сервере, т.к. у локальной базы нет соединения с новостным центром)
			ОткрытьФорму(
				"Справочник.Новости.Форма.ФормаДокумента",
				ПараметрыОткрытия,
				ЭтотОбъект,
				лкТекущаяСтрока);
		Иначе // Пустой список - новая база?
			ПараметрыОткрытия = СформироватьПараметрыОткрытияФормыРедактированияНовости(
				ЭтотОбъект.Справочник_Новости_ПустаяСсылка,
				Копирование,
				ЭтотОбъект.Справочник_Новости_ПустаяСсылка,
				0); // Нет на сервере вообще
			ОткрытьФорму(
				"Справочник.Новости.Форма.ФормаДокумента",
				ПараметрыОткрытия,
				ЭтотОбъект,
				лкТекущаяСтрока);
		КонецЕсли;
	КонецЕсли;

	// Оповестить открытую форму о содержимом буфера обмена.
	// Передавать надо список значений со структурами.
	КлючОбъекта = "Документы.Новости.КатегорииПростые";
	ТекущийБуферОбмена = Новый СписокЗначений;
	Для каждого ТекущаяСтрока Из ЭтотОбъект.БуферОбмена_КатегорииПростые Цикл
		СтруктураДанных = ОбработкаНовостейКлиентСервер.ПолучитьОписаниеПолейБуфераОбмена(КлючОбъекта);
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ТекущаяСтрока);
		ТекущийБуферОбмена.Добавить(СтруктураДанных);
	КонецЦикла;
	Оповестить(
		"БуферОбмена: скопировано значение", // АПК:1297 Это идентификатор.
		ТекущийБуферОбмена,
		Новый Структура("Ссылка, КлючОбъекта", Неопределено, КлючОбъекта));

	КлючОбъекта = "Документы.Новости.КатегорииИнтервалыВерсий";
	ТекущийБуферОбмена = Новый СписокЗначений;
	Для каждого ТекущаяСтрока Из ЭтотОбъект.БуферОбмена_КатегорииИнтервалыВерсий Цикл
		СтруктураДанных = ОбработкаНовостейКлиентСервер.ПолучитьОписаниеПолейБуфераОбмена(КлючОбъекта);
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ТекущаяСтрока);
		ТекущийБуферОбмена.Добавить(СтруктураДанных);
	КонецЦикла;
	Оповестить(
		"БуферОбмена: скопировано значение", // АПК:1297 Это идентификатор.
		ТекущийБуферОбмена,
		Новый Структура("Ссылка, КлючОбъекта", Неопределено, КлючОбъекта));

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;

	лкТекущаяСтрока = Элементы.НовостиСписок.ТекущаяСтрока;

	// Нельзя редактировать новости, если нет ни одной локальной ленты новостей, где можно редактировать новости.
	// Разрешено редактировать все локальные ленты новостей пользователю с ролями АдминистраторСистемы и ПолныеПрава.
	// Разрешено редактировать разрешенные администратором локальные ленты новостей пользователю с ролью РедактированиеНовостей.
	// Текст сообщения слишком длинный (более 247 символов), чтобы разместить его во всплывающей подсказке к элементу "НовостиСписок".
	Если ЭтотОбъект.РазрешенныеДляРедактированияЛентыНовостей.НайтиПоЗначению(Элемент.ТекущиеДанные.ЛентаНовостей) = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Редактировать можно только в локальной ленте новостей (администраторам - во всех локальных лентах, редакторам новостей - только в разрешенных им лентах).'");
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Ограничения для редактирования'"),
			,
			ТекстСообщения,
			,
			СтатусОповещенияПользователя.Важное,
			"");
		// Возврат; // Форма откроется,но будет только для просмотра.
	КонецЕсли;

	ПараметрыОткрытия = СформироватьПараметрыОткрытияФормыРедактированияНовости(
		лкТекущаяСтрока, // Ключ
		Ложь, // Копирование
		ЭтотОбъект.Справочник_Новости_ПустаяСсылка, // ЗначениеКопирования
		0); // СтатусНовостиНаСервере = 0 (нет на сервере, т.к. у локальной базы нет соединения с новостным центром)

	ОткрытьФорму(
		"Справочник.Новости.Форма.ФормаДокумента",
		ПараметрыОткрытия,
		ЭтотОбъект,
		лкТекущаяСтрока);

	// Оповестить открытую форму о содержимом буфера обмена.
	// Передавать надо список значений со структурами.
	КлючОбъекта = "Документы.Новости.КатегорииПростые";
	ТекущийБуферОбмена = Новый СписокЗначений;
	Для каждого ТекущаяСтрока Из ЭтотОбъект.БуферОбмена_КатегорииПростые Цикл
		СтруктураДанных = ОбработкаНовостейКлиентСервер.ПолучитьОписаниеПолейБуфераОбмена(КлючОбъекта);
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ТекущаяСтрока);
		ТекущийБуферОбмена.Добавить(СтруктураДанных);
	КонецЦикла;
	Оповестить(
		"БуферОбмена: скопировано значение",
		ТекущийБуферОбмена,
		Новый Структура("Ссылка, КлючОбъекта", Неопределено, КлючОбъекта));

	КлючОбъекта = "Документы.Новости.КатегорииИнтервалыВерсий";
	ТекущийБуферОбмена = Новый СписокЗначений;
	Для каждого ТекущаяСтрока Из ЭтотОбъект.БуферОбмена_КатегорииИнтервалыВерсий Цикл
		СтруктураДанных = ОбработкаНовостейКлиентСервер.ПолучитьОписаниеПолейБуфераОбмена(КлючОбъекта);
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ТекущаяСтрока);
		ТекущийБуферОбмена.Добавить(СтруктураДанных);
	КонецЦикла;
	Оповестить(
		"БуферОбмена: скопировано значение",
		ТекущийБуферОбмена,
		Новый Структура("Ссылка, КлючОбъекта", Неопределено, КлючОбъекта));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПересчетСлужебныхДанных(Команда)
	
	ПересчетСлужебныхДанныхНаСервере();
	Элементы.НовостиСписок.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Формирует структуру параметров для открытия формы редактирования новости.
//
// Параметры:
//  Ключ                   - СправочникСсылка.Новости;
//  Копирование            - Булево;
//  ЗначениеКопирования    - СправочникСсылка.Новости;
//  СтатусНовостиНаСервере - Число:
//    * 0 - Нет на сервере вообще;
//    * 1 - Есть на сервере, но не опубликована;
//    * 2 - Есть на сервере, опубликована, можно повторно публиковать;
//    * 3 - Есть на сервере, опубликована, нельзя повторно публиковать;
//    * 4 - Все остальное.
//
// Возвращаемое значение:
//   Структура.
//
Функция СформироватьПараметрыОткрытияФормыРедактированияНовости(Ключ, Копирование, ЗначениеКопирования, СтатусНовостиНаСервере)

	ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Ключ", Ключ);
		ПараметрыОткрытия.Вставить("Копирование", Копирование);
		ПараметрыОткрытия.Вставить("ЗначениеКопирования", ЗначениеКопирования);
		ПараметрыОткрытия.Вставить("СтатусНовостиНаСервере", СтатусНовостиНаСервере);
		ПараметрыОткрытия.Вставить("ТаблицаМетаданных", ЭтотОбъект.ТаблицаМетаданных);
		ПараметрыОткрытия.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
		ПараметрыОткрытия.Вставить("БезАвторизации", Истина);
		ПараметрыОткрытия.Вставить("БуферОбмена_КатегорииПростые", ЭтотОбъект.БуферОбмена_КатегорииПростые);
		ПараметрыОткрытия.Вставить("БуферОбмена_КатегорииИнтервалыВерсий", ЭтотОбъект.БуферОбмена_КатегорииИнтервалыВерсий);
		ПараметрыОткрытия.Вставить("РазрешенныеДляРедактированияЛентыНовостей", ЭтотОбъект.РазрешенныеДляРедактированияЛентыНовостей);

	Возврат ПараметрыОткрытия;

КонецФункции

&НаСервере
// Заполняет реквизиты формы БуферОбмена_КатегорииПростые и БуферОбмена_КатегорииИнтервалыВерсий по переданной структуре.
//
// Параметры:
//  БуферыОбмена - Структура - структура с ключами:
//   * БуферОбмена_КатегорииПростые;
//   * БуферОбмена_КатегорииИнтервалыВерсий.
//
Процедура ЗаполнитьБуферОбменаКатегорийСервер(Знач БуферыОбмена)

	БуферыОбменаЭталон = Новый Структура;
		БуферыОбменаЭталон.Вставить("БуферОбмена_КатегорииПростые"        , Новый СписокЗначений);
		БуферыОбменаЭталон.Вставить("БуферОбмена_КатегорииИнтервалыВерсий", Новый СписокЗначений);

	ЗаполнитьЗначенияСвойств(БуферыОбменаЭталон, БуферыОбмена);

	ЭтотОбъект.БуферОбмена_КатегорииПростые.Загрузить(БуферыОбменаЭталон.БуферОбмена_КатегорииПростые.Выгрузить());
	ЭтотОбъект.БуферОбмена_КатегорииИнтервалыВерсий.Загрузить(БуферыОбменаЭталон.БуферОбмена_КатегорииИнтервалыВерсий.Выгрузить());

КонецПроцедуры

// Процедура пересчитывает разные служебные данные, необходимые для корректной работы механизмов подсистемы "Новости":
//  - важность новостей;
//  - привязка к метаданным;
//  - настроенные отборы;
//  - и т.п.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура ПересчетСлужебныхДанныхНаСервере()

	НаименованиеМетода = "Новости.ФормаСпискаДляРедактирования.ПересчетСлужебныхДанныхНаСервере"; // АПК:1297 Это идентификатор.

	КонтекстВыполнения = ОбработкаНовостейКлиентСервер.НовыйКонтекстВыполнения(НаименованиеМетода, Истина); // Этот контекст.
	КонтекстВыполненияВложенный = ОбработкаНовостейКлиентСервер.НачатьШагВыполненияВложенный(
		КонтекстВыполнения,
		"Запуск:" + НаименованиеМетода,
		НаименованиеМетода);

		УстановитьПривилегированныйРежим(Истина);

			// Удалить неправильные отборы, которые могут помешать проверке общих и пользовательских отборов.
			// В разделенном сеансе будут пересчитаны только пользовательские отборы и общие для области данных.
			ОбработкаНовостейСлужебный.ОптимизироватьОтборыПоНовостям(КонтекстВыполненияВложенный);

			// Рассчитать заново регистр "РассчитанныеОтборыПоНовостям_РедкоМеняющиеся" для отборов
			//  по новостям по редко меняющимся категориям (версия конфигурации, платформы, продукт).
			ОбработкаНовостейСлужебный.ПересчитатьОтборыПоНовостям_РедкоМеняющиеся(КонтекстВыполненияВложенный);

			// Рассчитать заново регистр "РассчитанныеОтборыПоНовостям_Общие" для отборов
			//  по новостям, настроенных администратором.
			// Здесь же пересчитаются отборы по всем пользователям - регистр "РассчитанныеОтборыПоНовостям_Пользовательские" для отборов
			//  по новостям, настроенных пользователем.
			// Может работать в модели сервиса.
			ОбработкаНовостейСлужебный.ПересчитатьОтборыПоНовостям_Общие(КонтекстВыполненияВложенный);

			// Рассчитать заново регистр "РассчитанныеОтборыПоНовостям_ДляОбластиДанных" для отборов
			//  по новостям, настроенных для областей данных.
			// Может работать в модели сервиса.
			ОбработкаНовостейСлужебный.ПересчитатьОтборыПоНовостям_ДляОбластиДанных(КонтекстВыполненияВложенный);

			// Рассчитывать заново регистр "РассчитанныеОтборыПоНовостям_Пользовательские" для отборов
			//  по новостям, настроенных для пользователей - не нужно,
			//  т.к. он выполняется в ОбработкаНовостейСлужебный.ПересчитатьОтборыПоНовостям_Общие.

			// Пересчитать регистр "ПериодическиеСвойстваНовостей" - возможно, поменялась важность / актуальность
			//  и другие периодические свойства новостей. Также надо добавить записи для новых новостей.
			ОбработкаНовостейСлужебный.ОбновлениеПериодическихСвойствНовостей(КонтекстВыполненияВложенный);

			// Пересчитать регистр "ПривязкаНовостейКМетаданным" - возможно, поменялась важность
			//  и другие периодические свойства новостей. Также надо добавить записи для новых новостей.
			ОбработкаНовостейСлужебный.ОбновлениеПривязокКМетаданным(КонтекстВыполненияВложенный);

		УстановитьПривилегированныйРежим(Ложь);

		ЭтотОбъект.НеобходимПересчетСлужебныхДанных = Ложь;

	ШагВыполнения = ОбработкаНовостейКлиентСервер.ЗавершитьШагВыполнения(КонтекстВыполнения, 0, "", КонтекстВыполненияВложенный);

	ОбработкаНовостейСлужебный.ЗаписатьКонтекстВыполненияВЖурналРегистрации(КонтекстВыполнения);

КонецПроцедуры

#КонецОбласти
